"""regions_okrugs_industries added

Revision ID: d5113edd64af
Revises: 234055f61947
Create Date: 2022-09-06 14:28:56.092320

"""
from alembic import op

# revision identifiers, used by Alembic.
revision = 'd5113edd64af'
down_revision = '234055f61947'
branch_labels = None
depends_on = None


def upgrade():
    op.execute("INSERT INTO okrugs VALUES"
               " (1, 'Центральный'),"
               " (3, 'Южный'),"
               " (2, 'Северо-Западный'),"
               " (8, 'Дальневосточный'),"
               " (7, 'Сибирский'),"
               " (6, 'Уральский'),"
               " (5, 'Приволжский'),"
               " (4, 'Северо-Кавказский')")

    op.execute('INSERT INTO regions VALUES'
               ' (31, "Белгородская область", 1),'
               ' (32, "Брянская область", 1),'
               ' (33, "Владимирская область", 1),'
               ' (36, "Воронежская область", 1),'
               ' (37, "Ивановская область", 1),'
               ' (40, "Калужская область", 1),'
               ' (44, "Костромская область", 1),'
               ' (46, "Курская область", 1),'
               ' (48, "Липецкая область", 1),'
               ' (50, "Московская область", 1),'
               ' (57, "Орловская область", 1),'
               ' (62, "Рязанская область", 1),'
               ' (67, "Смоленская область", 1),'
               ' (68, "Тамбовская область", 1),'
               ' (69, "Тверская область", 1),'
               ' (71, "Тульская область", 1),'
               ' (76, "Ярославская область", 1),'
               ' (77, "Москва", 1),'
               ' (1, "Республика Адыгея", 3),'
               ' (8, "Республика Калмыкия", 3),'
               ' (23, "Краснодарский край", 3),'
               ' (30, "Астраханская область", 3),'
               ' (34, "Волгоградская область", 3),'
               ' (61, "Ростовская область", 3),'
               ' (91, "Республика Крым", 3),'
               ' (92, "Севастополь", 3),'
               ' (10, "Республика Карелия", 2),'
               ' (11, "Республика Коми", 2),'
               ' (29, "Архангельская область", 2),'
               ' (35, "Вологодская область", 2),'
               ' (39, "Калининградская область", 2),'
               ' (47, "Ленинградская область", 2),'
               ' (51, "Мурманская область", 2),'
               ' (53, "Новгородская область", 2),'
               ' (60, "Псковская область", 2),'
               ' (78, "Санкт-Петербург", 2),'
               ' (83, "Ненецкий автономный округ", 2),'
               ' (14, "Республика Саха (Якутия)", 8),'
               ' (41, "Камчатский край", 8),'
               ' (25, "Приморский край", 8),'
               ' (27, "Хабаровский край", 8),'
               ' (28, "Амурская область", 8),'
               ' (49, "Магаданская область", 8),'
               ' (65, "Сахалинская область", 8),'
               ' (79, "Еврейская автономная область", 8),'
               ' (87, "Чукотский автономный округ", 8),'
               ' (4, "Республика Алтай", 7),'
               ' (3, "Республика Бурятия", 7),'
               ' (17, "Республика Тыва", 7),'
               ' (19, "Республика Хакасия", 7),'
               ' (22, "Алтайский край", 7),'
               ' (75, "Забайкальский край", 7),'
               ' (24, "Красноярский край", 7),'
               ' (38, "Иркутская область", 7),'
               ' (42, "Кемеровская область - Кузбасс", 7),'
               ' (54, "Новосибирская область", 7),'
               ' (55, "Омская область", 7),'
               ' (70, "Томская область", 7),'
               ' (45, "Курганская область", 6),'
               ' (66, "Свердловская область", 6),'
               ' (72, "Тюменская область", 6),'
               ' (74, "Челябинская область", 6),'
               ' (86, "Ханты-Мансийский автономный округ - Югра", 6),'
               ' (89, "Ямало-Ненецкий автономный округ", 6),'
               ' (2, "Республика Башкортостан", 5),'
               ' (12, "Республика Марий Эл", 5),'
               ' (13, "Республика Мордовия", 5),'
               ' (16, "Республика Татарстан", 5),'
               ' (18, "Удмуртская Республика", 5),'
               ' (21, "Чувашская Республика - Чувашия", 5),'
               ' (43, "Кировская область", 5),'
               ' (52, "Нижегородская область", 5),'
               ' (56, "Оренбургская область", 5),'
               ' (58, "Пензенская область", 5),'
               ' (63, "Самарская область", 5),'
               ' (64, "Саратовская область", 5),'
               ' (73, "Ульяновская область", 5),'
               ' (59, "Пермский край", 5),'
               ' (5, "Республика Дагестан", 4),'
               ' (6, "Республика Ингушетия", 4),'
               ' (7, "Кабардино-Балкарская Республика", 4),'
               ' (9, "Карачаево-Черкесская Республика", 4),'
               ' (15, "Республика Северная Осетия - Алания", 4),'
               ' (20, "Чеченская Республика", 4),'
               ' (26, "Ставропольский край", 4),'
               ' (99, "Иные территории, включая город и космодром Байконур", NULL)')

    op.execute('INSERT INTO industries VALUES (1, "здравоохранение"),'
               ' (2, "наука"),'
               ' (3, "транспорт"),'
               ' (4, "связь"),'
               ' (5, "банковская сфера и иные сферы финансового рынка"),'
               ' (6, "энергетика"),'
               ' (7, "атомная энергия"),'
               ' (8, "оборонная промышленность"),'
               ' (9, "ракетно-космическая промышленность"),'
               ' (10, "горнодобывающая промышленность"),'
               ' (11, "металлургическая промышленность"),'
               ' (12, "химическая промышленность"),'
               ' (13, "топливно-энергетический комплекс")')


def downgrade():
    op.execute("DELETE FROM okrugs")
    op.execute("DELETE FROM regions")
    op.execute("DELETE FROM industries")
