"""Географические сведения о регионах Российской Федерации
из статьи 65 Конституции Российской Федерации."""

geography = {
    (1, 'Центральный'): [
        ('Белгородская область', 31),
        ('Брянская область', 32),
        ('Владимирская область', 33),
        ('Воронежская область', 36),
        ('Ивановская область', 37),
        ('Калужская область', 40),
        ('Костромская область', 44),
        ('Курская область', 46),
        ('Липецкая область', 48),
        ('Московская область', 50),
        ('Орловская область', 57),
        ('Рязанская область', 62),
        ('Смоленская область', 67),
        ('Тамбовская область', 68),
        ('Тверская область', 69),
        ('Тульская область', 71),
        ('Ярославская область', 76),
        ('Москва', 77)
    ],
    (3, 'Южный'): [
        ('Республика Адыгея', 1),
        ('Республика Калмыкия', 8),
        ('Краснодарский край', 23),
        ('Астраханская область', 30),
        ('Волгоградская область', 34),
        ('Ростовская область', 61),
        ('Республика Крым', 91),
        ('Севастополь', 92)
    ],
    (2, 'Северо-Западный'): [
        ('Республика Карелия', 10),
        ('Республика Коми', 11),
        ('Архангельская область', 29),
        ('Вологодская область', 35),
        ('Калининградская область', 39),
        ('Ленинградская область', 47),
        ('Мурманская область', 51),
        ('Новгородская область', 53),
        ('Псковская область', 60),
        ('Санкт-Петербург', 78),
        ('Ненецкий автономный округ', 83)
    ],
    (8, 'Дальневосточный'): [
        ('Республика Саха (Якутия)', 14),
        ('Камчатский край', 41),
        ('Приморский край', 25),
        ('Хабаровский край', 27),
        ('Амурская область', 28),
        ('Магаданская область', 49),
        ('Сахалинская область', 65),
        ('Еврейская автономная область', 79),
        ('Чукотский автономный округ', 87)
    ],
    (7, 'Сибирский'): [
        ('Республика Алтай', 4),
        ('Республика Бурятия', 3),
        ('Республика Тыва', 17),
        ('Республика Хакасия', 19),
        ('Алтайский край', 22),
        ('Забайкальский край', 75),
        ('Красноярский край', 24),
        ('Иркутская область', 38),
        ('Кемеровская область - Кузбасс', 42),
        ('Новосибирская область', 54),
        ('Омская область', 55),
        ('Томская область', 70)
    ],
    (6, 'Уральский'): [
        ('Курганская область', 45),
        ('Свердловская область', 66),
        ('Тюменская область', 72),
        ('Челябинская область', 74),
        ('Ханты-Мансийский автономный округ - Югра', 86),
        ('Ямало-Ненецкий автономный округ', 89)
    ],
    (5, 'Приволжский'): [
        ('Республика Башкортостан', 2),
        ('Республика Марий Эл', 12),
        ('Республика Мордовия', 13),
        ('Республика Татарстан', 16),
        ('Удмуртская Республика', 18),
        ('Чувашская Республика - Чувашия', 21),
        ('Кировская область', 43),
        ('Нижегородская область', 52),
        ('Оренбургская область', 56),
        ('Пензенская область', 58),
        ('Самарская область', 63),
        ('Саратовская область', 64),
        ('Ульяновская область', 73),
        ('Пермский край', 59)
    ],
    (4, 'Северо-Кавказский'): [
        ('Республика Дагестан', 5),
        ('Республика Ингушетия', 6),
        ('Кабардино-Балкарская Республика', 7),
        ('Карачаево-Черкесская Республика', 9),
        ('Республика Северная Осетия - Алания', 15),
        ('Чеченская Республика', 20),
        ('Ставропольский край', 26)
    ]
}
