"""Сферы деятельности ОКИИ из приказа ФСТЭК № 227
URL http://publication.pravo.gov.ru/Document/View/0001201802090010."""

industries = {
    1: "здравоохранение",
    2: "наука",
    3: "транспорт",
    4: "связь",
    5: "банковская сфера и иные сферы финансового рынка",
    6: "энергетика",
    7: "атомная энергия",
    8: "оборонная промышленность",
    9: "ракетно-космическая промышленность",
    10: "горнодобывающая промышленность",
    11: "металлургическая промышленность",
    12: "химическая промышленность",
    13: "топливно - энергетический комплекс"
}
